app/controllers/login_controller.rb

INSERT INTO `bills` (`date`, `rate`, `flag`, `description`, `amount`, `amount_inr`, `item_code`, `curr`, `user_name`, `month_year`, `bill_date`) VALUES('2009-03-31 00:00:00', 134, 0, 'bill1', 213, 134, 2, '123', 'vamsi', 'March-09', NULL)
INSERT INTO `months` (`month`, `amount`, `year`, `user_name`) VALUES('March', 123, 2009, 'vamsi')
---
  def create
    @title = "Expense Calculator"
    @bills = Bill.new(params[:bill])
    @bills.date = Time.now.strftime("%d-%B-%y")
    @bills.user_name = session[:user_name]
    @bills.month_year = Time.now.strftime("%B") + "-" + Time.now.strftime("%y")
    if @bills.save

SELECT month_year, sum(amount) as amount FROM `bills` WHERE (user_name = 'vamsi') GROUP BY month_year
SELECT sum(`bills`.amount) AS sum_amount FROM `bills` WHERE (month = 'March')
---
  def index
    @title = "Expense Calculator"
    flash[:notice] = nil
    unless session[:user_id]
      flash[:notice] = "Please log in first"
      redirect_to :action => "login"
      return
    end
    @user_name = session[:user_name]
    @bills = Bill.find(:all,:select => 'month_year, sum(amount) as amount', :conditions => "user_name = '#{@user_name}'",:group => "month_year")

SELECT * FROM `users` WHERE (`users`.`user_name` = 'vamsi' AND `users`.`password` = 'vamsi') LIMIT 1
---
  def login
    @title = "Log in to Expense Calculator"
    if request.post? and params[:user]
      @user = User.new(params[:user])
      user = User.find_by_user_name_and_password(@user.user_name,@user.password)

SELECT * FROM `bills` WHERE (month_year = 'April-09' AND user_name = 'vamsi')
DELETE FROM `bills` WHERE `id` = 37
SELECT * FROM `bills` WHERE (`bills`.`user_name` = 'vamsi' AND `bills`.`month_year` = 'April-09') LIMIT 1
---
  def destroy
    @bill = Bill.find(params[:id])
    @bill.destroy
    @bills = Bill.find(:all, :conditions => "month_year = '#{'April-09'}' AND user_name = '#{session[:user_name]}'")

SELECT * FROM `bills` WHERE (`bills`.`month_year` = 'March-2009' AND `bills`.`user_name` = 'vamsi') LIMIT 1
---
  def view
    @title = "Expense Calculator"
    @items = Item.find(:all)
    @month_year = params[:month_year]
    @bills = Bill.find(:all, :conditions => "month_year = '#{@month_year}'AND user_name = '#{session[:user_name]}'")

SELECT * FROM `bills`
---

    @bills = Bill.find(:all)
    row =12
    @bills.each do |bill|